# CurtainPanelNotBelongsToElement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CurtainPanelNotBelongsToElement Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Curtain element Panel doesn't belong to Curtain element. In merging, you must select the version of a Curtain element that has had Panels added to it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainPanelNotBelongsToElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainPanelNotBelongsToElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainPanelNotBelongsToElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace